## Plan Result (Infrastructure)




<pre><code>Plan: 20 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azuread_group_member.group_membership
  * azurerm_cosmosdb_account.this
  * azurerm_cosmosdb_sql_container.this[&#34;aksversions&#34;]
  * azurerm_cosmosdb_sql_container.this[&#34;docsoutdated&#34;]
  * azurerm_cosmosdb_sql_container.this[&#34;helmcharts&#34;]
  * azurerm_cosmosdb_sql_container.this[&#34;paloalto&#34;]
  * azurerm_cosmosdb_sql_container.this[&#34;renovate&#34;]
  * azurerm_cosmosdb_sql_database.this
  * azurerm_cosmosdb_sql_role_assignment.this
  * azurerm_key_vault_secret.cosmos_endpoint
  * azurerm_key_vault_secret.cosmos_key
  * azurerm_key_vault_secret.cosmosdb_database_name
  * azurerm_resource_group.this
  * module.version_reporter_key_vault.azurerm_key_vault.kv
  * module.version_reporter_key_vault.azurerm_key_vault_access_policy.creator_access_policy
  * module.version_reporter_key_vault.azurerm_key_vault_access_policy.developer[0]
  * module.version_reporter_key_vault.azurerm_key_vault_access_policy.implicit_managed_identity_access_policy[0]
  * module.version_reporter_key_vault.azurerm_key_vault_access_policy.product_team_access_policy
  * module.version_reporter_key_vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.version_reporter_key_vault.azurerm_user_assigned_identity.managed_identity[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azuread_group_member.group_membership will be created
  + resource "azuread_group_member" "group_membership" {
      + group_object_id  = "9af4d172-3664-49ea-902e-9e1039574590"
      + id               = (known after apply)
      + member_object_id = (known after apply)
    }

  # azurerm_cosmosdb_account.this will be created
  + resource "azurerm_cosmosdb_account" "this" {
      + access_key_metadata_writes_enabled           = true
      + analytical_storage_enabled                   = false
      + automatic_failover_enabled                   = true
      + connection_strings                           = (sensitive value)
      + create_mode                                  = (known after apply)
      + default_identity_type                        = "FirstPartyIdentity"
      + enable_automatic_failover                    = (known after apply)
      + enable_free_tier                             = (known after apply)
      + enable_multiple_write_locations              = (known after apply)
      + endpoint                                     = (known after apply)
      + free_tier_enabled                            = (known after apply)
      + id                                           = (known after apply)
      + is_virtual_network_filter_enabled            = false
      + kind                                         = "GlobalDocumentDB"
      + local_authentication_disabled                = false
      + location                                     = "uksouth"
      + minimal_tls_version                          = (known after apply)
      + mongo_server_version                         = (known after apply)
      + multiple_write_locations_enabled             = (known after apply)
      + name                                         = "version-reporter-stg-cosmos"
      + network_acl_bypass_for_azure_services        = false
      + offer_type                                   = "Standard"
      + partition_merge_enabled                      = false
      + primary_key                                  = (sensitive value)
      + primary_mongodb_connection_string            = (sensitive value)
      + primary_readonly_key                         = (sensitive value)
      + primary_readonly_mongodb_connection_string   = (sensitive value)
      + primary_readonly_sql_connection_string       = (sensitive value)
      + primary_sql_connection_string                = (sensitive value)
      + public_network_access_enabled                = true
      + read_endpoints                               = (known after apply)
      + resource_group_name                          = "version-reporter-stg-rg"
      + secondary_key                                = (sensitive value)
      + secondary_mongodb_connection_string          = (sensitive value)
      + secondary_readonly_key                       = (sensitive value)
      + secondary_readonly_mongodb_connection_string = (sensitive value)
      + secondary_readonly_sql_connection_string     = (sensitive value)
      + secondary_sql_connection_string              = (sensitive value)
      + tags                                         = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/version-reporter-services"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
          + "startupMode"  = "always"
        }
      + write_endpoints                              = (known after apply)

      + consistency_policy {
          + consistency_level = "Session"
        }

      + geo_location {
          + failover_priority = 0
          + id                = (known after apply)
          + location          = "uksouth"
          + zone_redundant    = true
        }
    }

  # azurerm_cosmosdb_sql_container.this["aksversions"] will be created
  + resource "azurerm_cosmosdb_sql_container" "this" {
      + account_name          = "version-reporter-stg-cosmos"
      + database_name         = "reports"
      + id                    = (known after apply)
      + name                  = "aksversions"
      + partition_key_kind    = "Hash"
      + partition_key_path    = "/clusterName"
      + partition_key_paths   = (known after apply)
      + partition_key_version = 2
      + resource_group_name   = "version-reporter-stg-rg"
      + throughput            = (known after apply)

      + autoscale_settings {
          + max_throughput = 4000
        }

      + indexing_policy {
          + indexing_mode = "consistent"

          + included_path {
              + path = "/*"
            }
        }
    }

  # azurerm_cosmosdb_sql_container.this["docsoutdated"] will be created
  + resource "azurerm_cosmosdb_sql_container" "this" {
      + account_name          = "version-reporter-stg-cosmos"
      + database_name         = "reports"
      + id                    = (known after apply)
      + name                  = "docsoutdated"
      + partition_key_kind    = "Hash"
      + partition_key_path    = "/docTitle"
      + partition_key_paths   = (known after apply)
      + partition_key_version = 2
      + resource_group_name   = "version-reporter-stg-rg"
      + throughput            = (known after apply)

      + autoscale_settings {
          + max_throughput = 4000
        }

      + indexing_policy {
          + indexing_mode = "consistent"

          + included_path {
              + path = "/*"
            }
        }
    }

  # azurerm_cosmosdb_sql_container.this["helmcharts"] will be created
  + resource "azurerm_cosmosdb_sql_container" "this" {
      + account_name          = "version-reporter-stg-cosmos"
      + database_name         = "reports"
      + id                    = (known after apply)
      + name                  = "helmcharts"
      + partition_key_kind    = "Hash"
      + partition_key_path    = "/namespace"
      + partition_key_paths   = (known after apply)
      + partition_key_version = 2
      + resource_group_name   = "version-reporter-stg-rg"
      + throughput            = (known after apply)

      + autoscale_settings {
          + max_throughput = 4000
        }

      + indexing_policy {
          + indexing_mode = "consistent"

          + included_path {
              + path = "/*"
            }
        }
    }

  # azurerm_cosmosdb_sql_container.this["paloalto"] will be created
  + resource "azurerm_cosmosdb_sql_container" "this" {
      + account_name          = "version-reporter-stg-cosmos"
      + database_name         = "reports"
      + id                    = (known after apply)
      + name                  = "paloalto"
      + partition_key_kind    = "Hash"
      + partition_key_path    = "/resourceType"
      + partition_key_paths   = (known after apply)
      + partition_key_version = 2
      + resource_group_name   = "version-reporter-stg-rg"
      + throughput            = (known after apply)

      + autoscale_settings {
          + max_throughput = 4000
        }

      + indexing_policy {
          + indexing_mode = "consistent"

          + included_path {
              + path = "/*"
            }
        }
    }

  # azurerm_cosmosdb_sql_container.this["renovate"] will be created
  + resource "azurerm_cosmosdb_sql_container" "this" {
      + account_name          = "version-reporter-stg-cosmos"
      + database_name         = "reports"
      + id                    = (known after apply)
      + name                  = "renovate"
      + partition_key_kind    = "Hash"
      + partition_key_path    = "/repository"
      + partition_key_paths   = (known after apply)
      + partition_key_version = 2
      + resource_group_name   = "version-reporter-stg-rg"
      + throughput            = (known after apply)

      + autoscale_settings {
          + max_throughput = 4000
        }

      + indexing_policy {
          + indexing_mode = "consistent"

          + included_path {
              + path = "/*"
            }
        }
    }

  # azurerm_cosmosdb_sql_database.this will be created
  + resource "azurerm_cosmosdb_sql_database" "this" {
      + account_name        = "version-reporter-stg-cosmos"
      + id                  = (known after apply)
      + name                = "reports"
      + resource_group_name = "version-reporter-stg-rg"
      + throughput          = (known after apply)

      + autoscale_settings {
          + max_throughput = 4000
        }
    }

  # azurerm_cosmosdb_sql_role_assignment.this will be created
  + resource "azurerm_cosmosdb_sql_role_assignment" "this" {
      + account_name        = "version-reporter-stg-cosmos"
      + id                  = (known after apply)
      + name                = (known after apply)
      + principal_id        = (known after apply)
      + resource_group_name = "version-reporter-stg-rg"
      + role_definition_id  = (known after apply)
      + scope               = (known after apply)
    }

  # azurerm_key_vault_secret.cosmos_endpoint will be created
  + resource "azurerm_key_vault_secret" "cosmos_endpoint" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "cosmos-endpoint"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.cosmos_key will be created
  + resource "azurerm_key_vault_secret" "cosmos_key" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "cosmos-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.cosmosdb_database_name will be created
  + resource "azurerm_key_vault_secret" "cosmosdb_database_name" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "cosmos-db-name"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_resource_group.this will be created
  + resource "azurerm_resource_group" "this" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "version-reporter-stg-rg"
      + tags     = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/version-reporter-services"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
          + "startupMode"  = "always"
        }
    }

  # module.version_reporter_key_vault.azurerm_key_vault.kv will be created
  + resource "azurerm_key_vault" "kv" {
      + access_policy                   = (known after apply)
      + enabled_for_deployment          = true
      + enabled_for_disk_encryption     = true
      + enabled_for_template_deployment = true
      + id                              = (known after apply)
      + location                        = "uksouth"
      + name                            = "version-reporter-stg"
      + public_network_access_enabled   = true
      + purge_protection_enabled        = true
      + resource_group_name             = "version-reporter-stg-rg"
      + sku_name                        = "standard"
      + soft_delete_retention_days      = 90
      + tags                            = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/version-reporter-services"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
          + "startupMode"  = "always"
        }
      + tenant_id                       = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
      + vault_uri                       = (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Allow"
        }
    }

  # module.version_reporter_key_vault.azurerm_key_vault_access_policy.creator_access_policy will be created
  + resource "azurerm_key_vault_access_policy" "creator_access_policy" {
      + certificate_permissions = [
          + "Create",
          + "Delete",
          + "DeleteIssuers",
          + "Get",
          + "GetIssuers",
          + "Import",
          + "List",
          + "ListIssuers",
          + "SetIssuers",
          + "Update",
          + "ManageContacts",
          + "ManageIssuers",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Create",
          + "List",
          + "Get",
          + "Delete",
          + "Update",
          + "Import",
          + "Backup",
          + "Restore",
          + "Decrypt",
          + "Encrypt",
          + "UnwrapKey",
          + "WrapKey",
          + "Sign",
          + "Verify",
          + "GetRotationPolicy",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "04939f22-03ce-4b89-9525-30d2757c6447"
      + secret_permissions      = [
          + "Set",
          + "List",
          + "Get",
          + "Delete",
          + "Recover",
          + "Purge",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.version_reporter_key_vault.azurerm_key_vault_access_policy.developer[0] will be created
  + resource "azurerm_key_vault_access_policy" "developer" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "b2a1773c-a5ae-48b5-b5fa-95b0e05eee05"
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.version_reporter_key_vault.azurerm_key_vault_access_policy.implicit_managed_identity_access_policy[0] will be created
  + resource "azurerm_key_vault_access_policy" "implicit_managed_identity_access_policy" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = (known after apply)
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.version_reporter_key_vault.azurerm_key_vault_access_policy.product_team_access_policy will be created
  + resource "azurerm_key_vault_access_policy" "product_team_access_policy" {
      + certificate_permissions = [
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "ManageContacts",
          + "ManageIssuers",
          + "GetIssuers",
          + "ListIssuers",
          + "SetIssuers",
          + "DeleteIssuers",
          + "Recover",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "Recover",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + secret_permissions      = [
          + "List",
          + "Set",
          + "Delete",
          + "Recover",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.version_reporter_key_vault.azurerm_monitor_diagnostic_setting.kv-ds will be created
  + resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
      + name                           = "version-reporter-stg"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category       = "AuditEvent"
            # (1 unchanged attribute hidden)
        }
    }

  # module.version_reporter_key_vault.azurerm_user_assigned_identity.managed_identity[0] will be created
  + resource "azurerm_user_assigned_identity" "managed_identity" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "version-reporter-stg-mi"
      + principal_id        = (known after apply)
      + resource_group_name = "managed-identities-stg-rg"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/version-reporter-services"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
          + "startupMode"  = "always"
        }
      + tenant_id           = (known after apply)
    }

Plan: 20 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cosmosdb_endpoint = (known after apply)
  + cosmosdb_url      = (known after apply)
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":146,"Program":"tfcmt","SHA1":"","Target":"Infrastructure","Vars":{}} -->